In [4]:
#LOAD CLIENT DATA FROM SQL FILE
import pandas as pd
import sqlite3

conn=sqlite3.connect(".memory")
cursor=conn.cursor()
sql_file=open('client_zoo.sql')
sql_as_str=sql_file.read()
cursor.executescript(sql_as_str)
for row in cursor.execute('SELECT * from client_zoo '):
    print(row)

sql_file.close()

', 390.24)
(218, 'Leonanie', 'Collin', 'Poland', '1', '0', '1', 'month', 3197.89)
(219, 'Kellen', 'Waggitt', 'Poland', '1', '0', '0', 'month', 2899.8)
(220, 'Kayley', 'Balentyne', None, '1', '0', '1', 'quarter', 1033.94)
(221, 'Grethel', 'Blundel', 'Poland', '0', '0', '1', 'quarter', 1443.2)
(222, 'Cyril', 'Draper', 'Czech Republic', '0', '1', '1', 'year', 5249.66)
(223, 'Dolores', 'Roggerone', 'Poland', '0', '0', '1', 'week', 1596.72)
(224, 'Jermaine', 'Farrear', 'Poland', '0', '1', '0', 'month', 2020.58)
(225, 'Karolina', 'Minards', 'Poland', '0', '1', '1', 'month', 2888.26)
(226, 'Paige', 'Splain', None, '0', '0', '1', 'month', 1904.42)
(227, 'Lezlie', 'Silber', 'Poland', '1', '0', '1', 'quarter', 4637.47)
(228, 'Lanny', "O'Shea", 'Poland', '1', '1', '0', 'quarter', 2454.4)
(229, 'Rosalie', 'Godrich', None, '1', '1', '1', 'quarter', 3465.88)
(230, 'Adrienne', 'Oakeby', None, '0', '1', '1', 'month', 2175.11)
(231, 'Silvana', 'Robertz', 'Czech Republic', '0', '1', '0', 'week', 4898.62)
(232, 'Hedwig', 'Stockall', 'Poland', '1', '1', '1', 'month', 4144.35)
(233, 'Verla', 'Ganforthe', 'Poland', '0', '1', '0', 'month', 1064.01)
(234, 'Coraline', 'Tripcony', 'Czech Republic', '0', '0', '0', 'quarter', 1219.61)
(235, 'Jacki', 'Crookshank', 'Poland', '0', '0', '1', 'week', 841.76)
(236, 'Deena', 'Bradbeer', 'Czech Republic', '0', '0', '1', 'year', 999.07)
(237, 'Sarita', 'Santostefano.', None, '0', '1', '1', 'month', 4339.35)
(238, 'Frederick', 'Kirrage', 'Poland', '0', '1', '1', 'quarter', 2583.89)
(239, 'Stefanie', 'Wardingly', 'Poland', '0', '0', '1', 'year', 2770.25)
(240, 'Florinda', 'Borles', None, '1', '1', '1', 'week', 13.63)
(241, 'Shem', 'Stepto', None, '0', '0', '1', 'week', 4533.31)
(242, 'Valeria', 'Pearlman', 'Czech Republic', None, None, None, 'year', 4308.85)
(243, 'Delcina', 'Buick', 'Poland', '1', '1', '0', 'quarter', 1230.51)
(244, 'Row', 'Wybourne', 'Czech Republic', '1', '1', '0', 'week', 3173.33)
(245, 'Linzy', 'Dines', 'Czech Republic', '1', '1', '0', 'week', 4158.53)
(246, 'Zara', 'Burlay', None, None, None, None, 'quarter', 5784.14)
(247, 'Diane-marie', 'Van Merwe', 'Poland', '0', '1', '0', 'month', 559.46)
(248, 'Salvador', 'Flay', 'Czech Republic', '0', '1', '1', 'month', 4820.75)
(249, 'Eva', 'Drysdall', 'Poland', None, None, None, 'week', 1332.62)
(250, 'Ethelbert', 'Espinet', 'Poland', '1', '0', '1', 'month', 3677.45)
(251, 'Giffer', 'Slane', None, '1', '0', '0', 'month', 672.85)
(252, 'Mirella', 'Posnett', None, '1', '1', '0', 'quarter', 395.13)
(253, 'Manda', 'Volkes', 'Germany', '1', '1', '1', 'quarter', 78.12)
(254, 'Obadiah', 'Allenson', 'Czech Republic', '1', '0', '0', 'year', 1274.26)
(255, 'Sandor', 'Leghorn', 'Poland', '1', '0', '0', 'week', 1349.33)
(256, 'Lindsey', 'Le Brum', None, '0', '0', '0', 'week', 182.88)
(257, 'Lane', 'Plowright', 'Czech Republic', '1', '1', '1', 'month', 5760.73)
(258, 'Darsie', 'Tesimon', 'Poland', '0', '0', '1', 'year', 1105.33)
(259, 'Taylor', 'Nugent', 'Poland', '1', '1', '0', 'year', 3462.72)
(260, 'Price', 'Rennox', 'Poland', '1', '1', '1', 'week', 5762.09)
(261, 'Joelie', 'Rosita', 'Poland', '0', '0', '1', 'quarter', 5230.79)
(262, 'Cherie', 'Scougal', 'Poland', '1', '0', '0', 'year', 5122.56)
(263, 'Gardener', 'Creenan', 'Poland', '0', '1', '0', 'quarter', 5280.36)
(264, 'Elisabeth', 'Linebarger', 'Czech Republic', None, None, None, 'year', 1986.12)
(265, 'Andee', 'Haith', 'Czech Republic', '1', '0', '0', 'week', 5528.2)
(266, 'Sherlocke', 'Cargenven', None, '1', '1', '0', 'week', 4519.4)
(267, 'Danna', 'Zavattero', None, '0', '0', '1', 'quarter', 1552.43)
(268, 'Jesus', 'Skyrme', 'Czech Republic', '0', '1', '0', 'quarter', 821.07)
(269, 'Constancia', 'Jarrett', 'Poland', '1', '0', '0', 'week', 4812.29)
(270, 'Evangelina', 'Antognelli', 'Poland', '0', '0', '1', 'year', 2780.8)
(271, 'Marys', 'Craythorn', 'Poland', '1', '0', '0', 'week', 5645.36)
(272, 'Edward', 'Ketts', None, '1', '1', '0', 'quarter', 5579.14)
(273, 'Fleming', 'Sheldrake', None, '0', '1', '1', 'week', 5445.18)
(274, 'Coretta', 'Euesden', 'Poland', '0', '1', '0', None, None)
(275, 'Kimbell', 'Turner', 'Poland', '0', '1', '1', 'week', 1531.17)
(276, 'Sheba', 'Ashpole', 'Poland', None, None, None, None, None)
(277, 'Tanhya', 'Brightwell', 'Poland', '0', '0', '0', 'week', 219.4)
(278, 'Johnette', 'Halsall', 'Poland', None, None, None, 'week', 1303.67)
(279, 'Petronille', 'Lilbourne', 'Poland', '0', '0', '1', 'month', 5927.22)
(280, 'Arron', 'Aleksandrov', 'Czech Republic', '1', '0', '0', 'month', 1719)
(281, 'Kyrstin', 'Catling', 'Czech Republic', None, None, None, 'week', 5242.93)
(282, 'Lilia', 'Hallagan', None, '0', '0', '1', 'year', 207.13)
(283, 'Lorelei', 'Fulop', 'Poland', '1', '0', '0', 'week', 590.37)
(284, 'Lutero', 'Tiesman', None, None, None, None, 'quarter', 5773.9)
(285, 'Devin', 'Cardon', 'Czech Republic', '0', '1', '0', 'quarter', 5349.99)
(286, 'Ellen', 'Fumagallo', None, '1', '0', '0', None, None)
(287, 'Bobbette', 'Weildish', 'Czech Republic', '0', '0', '0', 'year', 4313.83)
(288, 'Allina', 'Laugheran', 'Czech Republic', '0', '1', '0', 'quarter', 5270.12)
(289, 'Marlie', 'Hunnicutt', 'Poland', '0', '0', '0', 'year', 274.54)
(290, 'Fidole', 'Conor', None, '0', '1', '1', 'quarter', 1741.86)
(291, 'Annaliese', 'Ungerer', 'Poland', '0', '0', '0', 'month', 2324.19)
(292, 'Malachi', 'Cowans', 'Czech Republic', '1', '0', '0', 'month', 5601.12)
(293, 'Lusa', 'Danskine', 'Czech Republic', '0', '0', '0', 'week', 5868.36)
(294, 'Jean', 'April', None, '0', '0', '0', 'month', 1668.04)
(295, 'Laney', 'Minnock', None, '0', '0', '0', 'quarter', 5973.73)
(296, 'Fredek', 'Vasilik', 'Czech Republic', '1', '0', '1', 'month', 2285.47)
(297, 'Keven', 'Mingo', 'Germany', '0', '0', '0', 'week', 2133.93)
(298, 'Quillan', 'Larkworthy', 'Poland', '0', '0', '1', 'year', 1855.28)
(299, 'Anthiathia', 'Brockest', None, '0', '1', '1', 'quarter', 3760.67)
(300, 'Hildegarde', 'Ciccone', 'Poland', '1', '0', '0', 'month', 4703.93)
(301, 'Rebekah', 'Flanaghan', None, '1', '0', '1', 'quarter', 113.7)
(302, 'Debbi', 'Dominighi', 'Czech Republic', '0', '0', '0', 'week', 2563.92)
(303, 'Gerhardine', 'Brankley', 'Poland', '1', '0', '0', 'month', 5155.61)
(304, 'Keri', 'Baigent', 'Poland', '1', '0', '1', 'quarter', 2855.93)
(305, 'Yance', 'Brockherst', None, '0', '1', '1', 'quarter', 2280.17)
(306, 'Fanchette', 'Sutheran', None, '0', '1', '0', 'month', 1504.37)
(307, 'Coralyn', 'Joules', 'Poland', '0', '0', '0', 'month', 107.6)
(308, 'Joelle', 'Laister', 'Czech Republic', '1', '1', '0', 'quarter', 401.9)
(309, 'Minnnie', 'Winterbotham', None, '1', '1', '1', None, None)
(310, 'Sumner', 'Parks', 'Poland', '1', '1', '0', 'week', 473.5)
(311, 'Kipp', 'Cantrill', 'Germany', '1', '0', '0', 'year', 4575.33)
(312, 'Dalenna', 'Elnor', None, None, None, None, 'month', 3702.21)
(313, 'Keely', 'Catling', 'Poland', '1', '0', '0', 'quarter', 2966.15)
(314, 'Peirce', 'Raynard', 'Czech Republic', None, None, None, 'week', 1746.63)
(315, 'Philipa', 'Bysshe', 'Czech Republic', '0', '1', '1', None, None)
(316, 'Kerianne', 'Naden', 'Czech Republic', '1', '0', '1', 'week', 954.93)
(317, 'Neal', 'Lewknor', None, '0', '0', '1', 'quarter', 1016.7)
(318, 'Gil', 'Suggitt', 'Czech Republic', '0', '0', '1', 'quarter', 1287.96)
(319, 'Wynne', 'Faux', None, '1', '0', '1', 'quarter', 374.67)
(320, 'Myrlene', 'Coghlin', 'Czech Republic', None, None, None, 'week', 3159.47)
(321, 'Lonee', 'Paz', 'Poland', '0', '1', '0', 'month', 4947.11)
(322, 'Boycey', 'Letrange', 'Poland', '1', '0', '0', 'year', 1976.29)
(323, 'Ingrim', 'Matuszkiewicz', None, '1', '0', '1', 'quarter', 525.93)
(324, 'Scarlett', 'Rathbone', 'Poland', '0', '0', '1', 'year', 4523.55)
(325, 'Sibyl', 'Gaskoin', 'Czech Republic', '0', '0', '0', 'week', 1716.57)
(326, 'Nicolas', 'Launder', 'Poland', '1', '1', '1', 'week', 2981.03)
(327, 'Eddy', 'Dupey', 'Poland', '1', '1', '1', 'quarter', 3608.54)
(328, 'Roarke', 'Nicholl', 'Poland', '0', '0', '1', 'quarter', 2783.82)
(329, 'Renaud', 'Oakenfull', 'Poland', '0', '0', '1', 'year', 5358.04)
(330, 'Noah', 'Rickis', None, '1', '1', '1', 'year', 3358.39)
(331, 'Felita', 'Layborn', 'Czech Republic', '0', '0', '0', 'year', 2480.22)
(332, 'Gayleen', 'Mathey', None, '1', '0', '0', 'year', 4412.64)
(333, 'Aguie', 'Pingstone', 'Poland', '1', '0', '1', 'month', 86.81)
(334, 'Aylmar', 'Guiraud', 'Poland', '1', '1', '1', 'year', 1207.08)
(335, 'Henrik', 'Thorald', 'Poland', '1', '0', '0', 'week', 3873.89)
(336, 'Craggie', 'Lovelock', None, '1', '1', '1', 'quarter', 1530.88)
(337, 'Millard', 'Feltoe', 'Czech Republic', None, None, None, 'quarter', 743.17)
(338, 'Poppy', 'Kennally', None, '1', '0', '0', 'week', 3544.34)
(339, 'Benjie', 'Bishell', 'Poland', '1', '1', '0', 'week', 882.42)
(340, 'Amble', 'Masserel', None, '1', '0', '0', 'month', 3564.05)
(341, 'Meredith', 'Genn', 'Poland', None, None, None, 'year', 1980.16)
(342, 'Antonin', 'Trematick', None, '0', '1', '1', 'month', 4429.86)
(343, 'Marina', 'Heephy', None, '1', '1', '0', 'year', 3121.74)
(344, 'Justis', 'Cockshot', 'Poland', '1', '1', '1', 'year', 2098.42)
(345, 'Madge', 'Hanscomb', 'Czech Republic', '0', '0', '1', 'month', 228.08)
(346, 'Lief', 'Coxon', 'Czech Republic', '0', '0', '0', 'year', 1881.53)
(347, 'Mordy', 'Form', 'Poland', '1', '0', '1', 'month', 1767.81)
(348, 'Barbee', 'Aronstein', 'Poland', '1', '0', '0', 'month', 1935.91)
(349, 'Cthrine', 'Minchell', 'Czech Republic', '1', '1', '1', 'year', 5550.52)
(350, 'Dona', 'Rosengren', 'Poland', '0', '1', '1', 'year', 2859.26)
(351, 'Letty', 'Chessor', None, '0', '0', '1', 'year', 292.62)
(352, 'Erroll', 'Kensit', None, '1', '1', '1', 'year', 2314.67)
(353, 'Deloris', 'Penddreth', None, '1', '0', '0', 'week', 3688.5)
(354, 'Danica', 'Bodham', 'Poland', '1', '1', '0', 'quarter', 5069.23)
(355, 'Meryl', 'Ladewig', 'Czech Republic', '1', '0', '1', 'month', 5988.54)
(356, 'Lynnea', 'Swinden', 'Czech Republic', '1', '0', '0', 'year', 4338.64)
(357, 'Robinette', 'Brittian', 'Poland', '1', '1', '0', 'year', 3324.39)
(358, 'Valery', 'Cocksedge', 'Poland', '0', '1', '1', 'week', 3573.92)
(359, 'Petra', 'Booeln', 'Czech Republic', '0', '0', '0', 'month', 2111.28)
(360, 'Shelba', 'Somerset', None, '1', '1', '0', 'month', 3164.23)
(361, 'Sharron', 'Anespie', None, '1', '0', '0', 'year', 5216.79)
(362, 'Major', 'McIntee', None, '0', '0', '1', 'week', 1318.01)
(363, 'Carlyn', 'Marnes', 'Poland', '0', '1', '0', 'month', 5685.63)
(364, 'Georgianna', 'Romans', None, '1', '0', '1', 'week', 1726.22)
(365, 'Laina', 'Blenkiron', 'Poland', '0', '0', '0', 'year', 1874.52)
(366, 'Kamila', 'Eastman', 'Poland', '0', '1', '0', 'week', 1059.31)
(367, 'Ignatius', 'Fucher', None, '0', '1', '0', 'year', 3274.21)
(368, 'Nanete', 'Nuzzti', 'Poland', '0', '0', '1', 'quarter', 1220.2)
(369, 'Dayle', 'Braddon', 'Poland', '0', '1', '0', 'year', 2881)
(370, 'Stephannie', 'Devennie', None, '0', '0', '1', 'quarter', 4769.99)
(371, 'Spence', 'Hocking', 'Poland', '0', '1', '0', 'week', 5538.66)
(372, 'Jase', 'Zoppie', None, None, None, None, 'quarter', 5779.67)
(373, 'Peta', 'Couzens', None, '1', '1', '0', 'year', 1458.73)
(374, 'Ketti', 'Smees', 'Germany', None, None, None, 'quarter', 137.04)
(375, 'Kacey', 'Dudgeon', 'Czech Republic', '0', '1', '1', 'year', 2667.75)
(376, 'Elwira', 'Hrinchishin', 'Poland', None, None, None, 'week', 1436.84)
(377, 'Romola', 'Decker', 'Poland', None, None, None, 'quarter', 730.3)
(378, 'Roland', 'Laughtisse', None, '1', '1', '1', 'year', 3756.6)
(379, 'Lilyan', 'Strachan', 'Poland', '1', '1', '1', 'quarter', 2710.23)
(380, 'Veradis', 'Nethercott', 'Poland', '1', '0', '1', 'quarter', 2088.18)
(381, 'Ermina', 'Iori', 'Czech Republic', '0', '0', '1', 'year', 2699.94)
(382, 'Florri', 'de Savery', 'Poland', '1', '1', '1', 'week', 4749.04)
(383, 'Jessi', 'Morcom', 'Poland', '1', '1', '1', 'month', 2870.44)
(384, 'Britni', 'Speeks', 'Poland', '0', '0', '1', 'month', 1555.76)
(385, 'Rubia', 'Luttgert', 'Poland', '1', '0', '0', 'year', 776.57)
(386, 'Julio', 'Naylor', 'Poland', '0', '1', '0', 'year', 368.34)
(387, 'Pietrek', 'Lawly', None, None, None, None, 'quarter', 3938.31)
(388, 'Shelby', 'Standeven', None, '1', '0', '0', 'quarter', 3349.73)
(389, 'Percival', 'Dourin', 'Czech Republic', '1', '1', '0', 'week', 3185.51)
(390, 'Elvin', 'Piscopello', 'Poland', None, None, None, 'week', 1246.56)
(391, 'Erny', 'Trippett', 'Germany', '1', '0', '0', 'week', 3405.14)
(392, 'Iggy', 'Sacco', 'Poland', '1', '0', '0', 'year', 523.88)
(393, 'Lek', 'Harston', 'Poland', None, None, None, 'year', 5174.27)
(394, 'Hoyt', 'Budge', None, '1', '1', '1', 'week', 5848.44)
(395, 'Lionel', 'Altimas', 'Poland', '1', '0', '1', 'quarter', 1300.03)
(396, 'Lari', 'Humpage', None, '0', '1', '0', 'year', 843.46)
(397, 'Jacquelyn', 'Canete', 'Poland', '1', '0', '1', 'month', 3287.28)
(398, 'Bernadene', 'Creigan', 'Germany', '1', '0', '0', 'month', 2622.77)
(399, 'Micky', 'Mellonby', 'Germany', '0', '0', '0', 'week', 5489.46)
(400, 'Karin', 'Strange', 'Czech Republic', '1', '0', '1', 'quarter', 990.22)
(401, 'Farly', 'Kennham', 'Poland', '0', '0', '0', 'quarter', 2771.67)
(402, 'Padgett', 'MacKaile', 'Poland', None, None, None, 'quarter', 5565.87)
(403, 'Anita', 'Douche', None, '0', '1', '1', 'month', 821.82)
(404, 'Diana', 'Alven', 'Poland', '0', '1', '1', 'month', 2689.91)
(405, 'Reena', 'Simkiss', 'Czech Republic', '0', '0', '1', 'year', 2779.13)
(406, 'Blanche', 'Cherryman', 'Germany', '0', '0', '0', 'year', 2305.54)
(407, 'Dante', 'Giveen', None, '0', '1', '0', 'year', 2270.83)
(408, 'Bernetta', 'Dober', 'Poland', '1', '0', '0', 'quarter', 3497.31)
(409, 'Selia', 'Jenicke', 'Poland', '0', '0', '0', 'month', 3207.9)
(410, 'Josee', 'McKyrrelly', 'Poland', '1', '1', '1', 'month', 3932.87)
(411, 'Lara', 'Camlin', 'Poland', '1', '0', '1', 'year', 3399.33)
(412, 'Alfreda', 'Brigstock', 'Czech Republic', '1', '0', '1', 'month', 3083.07)
(413, 'Saunderson', 'Bedboro', None, '0', '0', '0', 'month', 112.69)
(414, 'Shem', 'Tudbald', 'Poland', '1', '0', '0', 'quarter', 4721.47)
(415, 'Tara', 'Edward', 'Czech Republic', '0', '1', '0', 'week', 3604.6)
(416, 'Bathsheba', 'Ropert', 'Czech Republic', '1', '0', '0', 'week', 3983.76)
(417, 'Jannel', 'Wellington', None, '0', '0', '1', 'year', 3504.7)
(418, 'Maure', 'Sherrard', 'Poland', '1', '0', '1', 'quarter', 1595.56)
(419, 'Alyce', 'McMyler', None, '0', '1', '0', None, None)
(420, 'Allsun', 'Frostdick', 'Czech Republic', '0', '0', '1', 'quarter', 1203.95)
(421, 'Tansy', 'Leggis', 'Poland', '1', '0', '1', 'month', 3408.57)
(422, 'Garner', 'Kurt', 'Poland', None, None, None, 'week', 4712.51)
(423, 'Tabbie', 'McDowall', 'Czech Republic', None, None, None, 'year', 5661.52)
(424, 'Mata', 'Triebner', 'Poland', '1', '1', '0', 'year', 3496.49)
(425, 'Brigg', 'McKelvie', None, '1', '1', '1', 'year', 1135.89)
(426, 'Elwood', 'Packer', 'Poland', '0', '0', '0', 'week', 1465.08)
(427, 'Malissa', 'Southway', 'Poland', None, None, None, 'month', 845.08)
(428, 'Godiva', 'Alonso', 'Poland', '0', '0', '0', 'quarter', 5087.77)
(429, 'Vassili', 'Heggs', 'Poland', '0', '1', '0', 'year', 392.7)
(430, 'Catlin', 'Swansbury', 'Poland', '0', '0', '0', 'quarter', 5283.07)
(431, 'Ilka', 'Woodworth', 'Poland', None, None, None, 'week', 3878.43)
(432, 'Gibb', 'Wink', None, '0', '1', '0', 'month', 2563.88)
(433, 'Fraze', 'Lansdown', None, '0', '1', '0', 'quarter', 5891.95)
(434, 'Deb', 'Mottini', None, '0', '0', '1', 'quarter', 563.31)
(435, 'Lanny', 'Santi', 'Czech Republic', '1', '1', '0', 'month', 5076.09)
(436, 'Evangelin', 'Debow', 'Poland', '1', '0', '0', 'year', 1950.03)
(437, 'Kirsten', 'Walton', None, '1', '0', '1', 'year', 5680.26)
(438, 'Nickola', 'Dinjes', 'Poland', '1', '0', '0', 'quarter', 2063.16)
(439, 'Lissa', 'Guttridge', 'Germany', '0', '0', '1', None, None)
(440, 'Kerrill', 'Gabbitas', None, '0', '0', '0', 'year', 235.05)
(441, 'Delphine', 'Pursehouse', None, '0', '0', '0', 'month', 1529.89)
(442, 'Pippo', 'Sutlieff', None, '1', '0', '0', 'month', 169.43)
(443, 'Wildon', 'Meiner', None, '1', '0', '0', 'quarter', 3330.23)
(444, 'Nikkie', 'Stephenson', 'Poland', '0', '0', '0', 'year', 2058.96)
(445, 'Jenine', 'Willavoys', 'Poland', '1', '0', '1', 'quarter', 5794.43)
(446, 'Halli', 'McKeon', 'Czech Republic', '0', '0', '0', 'month', 3126.26)
(447, 'Freeman', 'Banaszczyk', 'Czech Republic', '1', '1', '1', 'quarter', 375.35)
(448, 'Jeffie', 'Thoumas', None, '0', '0', '1', 'year', 305.96)
(449, 'Reynold', 'Lynthal', None, '1', '1', '1', 'quarter', 3374.89)
(450, 'Florina', 'Delgardo', 'Czech Republic', '1', '1', '1', 'quarter', 1256.37)
(451, 'Clarinda', 'Duddan', 'Austria', '1', '1', '1', 'month', 5111.98)
(452, 'Arron', 'Shepton', None, '1', '1', '1', 'year', 2647.28)
(453, 'Morey', 'Fero', 'Poland', None, None, None, 'quarter', 1542.29)
(454, 'Genevieve', 'Vasilic', 'Czech Republic', '0', '0', '0', None, None)
(455, 'Casar', 'McIlvaney', None, '1', '1', '1', 'quarter', 3919.05)
(456, 'Howey', 'Walsham', None, '0', '0', '1', 'quarter', 3629.46)
(457, 'Shelagh', 'Cocks', 'Germany', '0', '1', '0', 'year', 792.42)
(458, 'Brennen', 'Honisch', 'Poland', '0', '1', '0', 'year', 1744.06)
(459, 'Coralyn', 'Niess', 'Poland', None, None, None, 'year', 4367.03)
(460, 'Othella', 'Pascho', None, '1', '0', '0', 'quarter', 2221.74)
(461, 'Saxon', 'Chattelaine', 'Poland', '1', '0', '0', 'week', 5920.96)
(462, 'Darcy', 'Murrish', 'Poland', '1', '1', '1', 'month', 4757.15)
(463, 'Babette', 'Darlington', 'Czech Republic', '1', '0', '0', 'week', 2116.94)
(464, 'Hailey', 'Pretsell', 'Poland', '0', '1', '1', 'quarter', 3768.03)
(465, 'Lorens', 'Lovelady', 'Czech Republic', None, None, None, 'week', 159.81)
(466, 'Nannette', 'Smickle', None, '0', '0', '1', 'month', 3885.48)
(467, 'Tudor', 'Benkin', None, '1', '0', '1', 'week', 3804.48)
(468, 'Shoshanna', 'Skirving', None, '1', '1', '1', 'year', 572.7)
(469, 'Meir', 'Lewton', None, '1', '0', '0', 'year', 721.55)
(470, 'Felicle', 'Henze', 'Poland', '0', '1', '0', 'quarter', 1528.34)
(471, 'Dedie', 'Redrup', None, '1', '1', '1', 'week', 1378.44)
(472, 'Ulick', 'Marquez', 'Poland', '0', '0', '0', 'month', 3492.13)
(473, 'Brendan', 'Arthey', None, '0', '0', '0', 'quarter', 5597.4)
(474, 'Kizzie', 'Tyer', None, None, None, None, 'quarter', 2850.37)
(475, 'Port', 'Pill', None, '0', '0', '0', 'week', 3012.44)
(476, 'Lisette', 'Witty', 'Czech Republic', None, None, None, 'year', 2970.37)
(477, 'Isabella', 'Kiehne', 'Czech Republic', '1', '1', '1', 'quarter', 1340.23)
(478, 'Maribeth', 'Cutmere', 'Poland', '0', '1', '0', 'year', 4648.36)
(479, 'Carleton', 'Gagg', 'Poland', '1', '1', '0', 'quarter', 868.43)
(480, 'Elfie', 'Robez', None, '1', '0', '1', 'year', 674.73)
(481, 'Torey', 'Arling', None, '1', '1', '0', 'month', 1927.69)
(482, 'Tamar', 'Jump', 'Poland', None, None, None, 'month', 4303.76)
(483, 'Hurley', 'Salack', 'Poland', '0', '0', '0', 'month', 198.56)
(484, 'Latia', 'Elletson', 'Poland', '1', '0', '1', 'quarter', 328.61)
(485, 'Allis', 'Burdikin', None, '1', '1', '0', 'quarter', 4816.83)
(486, 'Birk', 'Dollimore', 'Czech Republic', '0', '0', '0', 'week', 3739.64)
(487, 'Tull', 'Saldler', None, '0', '1', '1', 'quarter', 5485.57)
(488, 'Dita', 'Mickleborough', None, None, None, None, 'quarter', 3044.71)
(489, 'Gwenneth', 'Harrowing', None, '0', '0', '1', 'month', 3668.22)
(490, 'Maurise', 'Flaune', None, None, None, None, 'year', 3158.27)
(491, 'Benedikta', 'Gerretsen', None, '1', '0', '1', 'week', 1185.89)
(492, 'Annnora', 'Starton', None, '1', '1', '1', 'month', 3400.28)
(493, 'Ladonna', 'McMenamy', None, '0', '0', '1', 'month', 4722.58)
(494, 'Lethia', 'Held', 'Czech Republic', '0', '0', '0', 'year', 754.38)
(495, 'Loren', 'Macquire', None, '1', '0', '0', 'week', 787.89)
(496, 'Dael', 'Maylam', 'Poland', '0', '0', '1', 'year', 1799.72)
(497, 'Nonnah', 'Habens', None, '0', '1', '0', 'year', 2629.06)
(498, 'Derward', 'Sandeford', 'Poland', None, None, None, 'year', 3559.92)
(499, 'Claudianus', 'Abelevitz', 'Germany', None, None, None, 'month', 145.19)
(500, 'Colan', 'Goodey', 'Poland', '1', '0', '0', 'month', 3293.49)

In [5]:
#file.sql change > sqlite3 file.db
# terminal cat client_zoo.sql | sqlite3 clientzoo.db

from sqlalchemy import create_engine

file_db='datasets/clientzoo.db'

engine=create_engine("sqlite:///{}".format(file_db))
sql='SELECT * from client_zoo'

order_data=pd.read_sql(sql,engine)
order_data

,id,first_name,last_name,location,cat,dog,other,frequency,sum_order
0,1,Betteann,Semaine,Czech Republic,0,1,1,week,2924.02
1,2,Marjorie,Seamon,None,0,1,0,week,3548.38
2,3,Filbert,Napoli,Poland,1,0,0,month,3114.94
3,4,Helenka,Yaakov,Poland,1,0,0,week,1412.04
4,5,Neel,Joselevitz,Czech Republic,0,0,1,quarter,5326.35
...,...,...,...,...,...,...,...,...,...
495,496,Dael,Maylam,Poland,0,0,1,year,1799.72
496,497,Nonnah,Habens,None,0,1,0,year,2629.06
497,498,Derward,Sandeford,Poland,None,None,None,year,3559.92
498,499,Claudianus,Abelevitz,Germany,None,None,None,month,145.19
499,500,Colan,Goodey,Poland,1,0,0,month,3293.49

In [11]:
# BASIC overall INFO -SUMA zamówienia 
order_data.sum_order.describe()

count     482.000000
mean     2881.633610
std      1753.071301
min        10.990000
25%      1318.520000
50%      2884.630000
75%      4373.762500
max      5988.540000
Name: sum_order, dtype: float64

In [19]:
#PREPARING DATA 
#cleaning DATA 

#ile jest NaN 
order_data.last_name.isna   #sprawdzenie jakie dane Missing/Nan/Null/Braki

<bound method Series.isna of 0         Semaine
2          Napoli
3          Yaakov
4      Joselevitz
6           Leere
          ...
483      Elletson
485     Dollimore
493          Held
495        Maylam
499        Goodey
Name: last_name, Length: 281, dtype: object>

In [15]:
#PREPARING DATA 
#cleaning DATA 
#>>MISSING INFO -drop rows with missing info

order_data=order_data.dropna()
order_data
#z 500 klientów wybrakowane dane z pozostało 281 klientów

,id,first_name,last_name,location,cat,dog,other,frequency,sum_order
0,1,Betteann,Semaine,Czech Republic,0,1,1,week,2924.02
2,3,Filbert,Napoli,Poland,1,0,0,month,3114.94
3,4,Helenka,Yaakov,Poland,1,0,0,week,1412.04
4,5,Neel,Joselevitz,Czech Republic,0,0,1,quarter,5326.35
6,7,Celinka,Leere,Poland,1,1,0,week,200.02
...,...,...,...,...,...,...,...,...,...
483,484,Latia,Elletson,Poland,1,0,1,quarter,328.61
485,486,Birk,Dollimore,Czech Republic,0,0,0,week,3739.64
493,494,Lethia,Held,Czech Republic,0,0,0,year,754.38
495,496,Dael,Maylam,Poland,0,0,1,year,1799.72
499,500,Colan,Goodey,Poland,1,0,0,month,3293.49

In [25]:
#>>check duplicated data 
order_data.duplicated()  #nie ma powtarzajacych się wpisów

0      False
2      False
3      False
4      False
6      False
       ...
483    False
485    False
493    False
495    False
499    False
Length: 281, dtype: bool

In [31]:
#ORGANIZING DATA  SORTING 
order_data.sort_values(by=['sum_order','frequency']) #min sum_order 19.11 a max 5988.54

,id,first_name,last_name,location,cat,dog,other,frequency,sum_order
124,125,Sharline,Sonier,Czech Republic,0,0,1,year,19.11
61,62,Dar,Sueter,Poland,0,1,1,year,22.37
89,90,Zelda,Woolfitt,Poland,1,0,0,month,32.83
252,253,Manda,Volkes,Germany,1,1,1,quarter,78.12
332,333,Aguie,Pingstone,Poland,1,0,1,month,86.81
...,...,...,...,...,...,...,...,...,...
292,293,Lusa,Danskine,Czech Republic,0,0,0,week,5868.36
460,461,Saxon,Chattelaine,Poland,1,0,0,week,5920.96
278,279,Petronille,Lilbourne,Poland,0,0,1,month,5927.22
48,49,Celka,Stanner,Czech Republic,0,0,0,quarter,5947.87
354,355,Meryl,Ladewig,Czech Republic,1,0,1,month,5988.54

In [36]:
#AGGREGATE SORTING
# example Sum of Order - Location Origin State

pd.pivot_table(order_data,values=['sum_order'], index=['location'])

                  sum_order
location
Austria         4202.705000
Czech Republic  3092.917590
Germany         3180.742857
Poland          2752.790879

In [42]:
df_freq=order_data.loc[order_data['frequency']=="week"]
pd.pivot_table(df_freq,index=['location'],aggfunc='max',values=['sum_order'])

                sum_order
location
Czech Republic    5868.36
Germany           5489.46
Poland            5920.96